app/Controllers/Home.php

    public function index()
    {


        $casasModel = new casasModel();
        $data['casas'] = $casasModel->find();
---
SELECT *
FROM `casas`

    public function usuario($usuario=null)
    {

        //session_start();
        //$_SESSION['asesor'] = 'marco';
        //$session = \Config\Services::session($config);
//$session->start();
        $_SESSION['asesor'] = $usuario;

  //      exit();
        $casasModel = new casasModel();
        $asesoresModel = new asesoresModel();
        $casausuarioModel = new casausuarioModel();
        $datas['casass'] = $asesoresModel->where('userasesor',$usuario)->countAllResults();

        if ($datas['casass']==0){
            echo 'no existe';
        }else{
            //echo 'si existe';
            $dato='';
                $query= $casausuarioModel->select('idCasa')->where('idAsesor',$usuario)->findAll();
                $cuenta=$casausuarioModel->select('idCasa')->where('idAsesor',$usuario)->CountAll();
---
SELECT COUNT(*) AS `numrows`
FROM `asesores`
WHERE `userasesor` = '1'
SELECT `idCasa`
FROM `casausuario`
WHERE `idAsesor` = '1'

                $categories[] = $username['idCasa'];
            }

     $data['casas']= $casasModel->whereIn('id',$categories)->findAll();
---
SELECT *
FROM `casas`
WHERE `id` IN ('1','2','3')

    public function casa($casa=null)
    {

        $casasModel = new casasModel();
        $data['casas'] = $casasModel->where('id',$casa)->find();
---
SELECT *
FROM `casas`
WHERE `id` = '1'