app/Controllers/Home.php

    public function casanaranja()
    {
        $casasModel = new casasModel();
        $data['casas'] = $casasModel->find();
---
SELECT *
FROM `casas`
WHERE `id` = '2'